import { Event } from '../components/event/event.model';

export class Schedule {
  static schedule: Event[] = [
    new Event ('Міжнародний спортивно-масовий захід серед учнів "ISF WORLD COOL GAMES"',
      new Date(2020, 11, 18), new Date(2020, 11, 23), 'Київ',  0, 'Україна', 'Київ'),
    new Event ('Чемпіонат України з рукопашного бою серед учнів',
      new Date(2020, 3, 15), new Date(2020, 3, 17), 'Київ',  1, 'Україна', 'Київ'),
    new Event ('ІІ зимова Гімназіада України з лижних гонок',
      new Date(2020, 3, 25), new Date(2020, 3, 26), 'смт Тисовець', 2,  'Україна', 'Львівська обл.'),
    new Event ('XV літня Універсіада України з тхеквондо (ВТФ) фінал',
      new Date(2020, 3, 5), new Date(2020, 3, 7), 'Івано-Франківськ', 3,  'Україна', 'Івано-Франківська обл.'),
    new Event ('Всесвітня літня Гімназіада',
      new Date(2020, 10, 10), new Date(2020, 10, 20), 'Дзіндзян', 4,  'Китайська Народна Республіка', ''),
    new Event ('Європейські університетські ігри',
      new Date(2020, 7, 18), new Date(2020, 7, 23), 'Бєлград', 5,  'Сербія', ''),
    new Event ('Всеукраїнський спортивно-масовий захід серед учнів "COOL GAMES" 2020-2021 років',
      new Date(2020, 9, 20), new Date(2021, 2, 23), 'регіони', 6,  'Україна', 'всі регіони'),
    new Event ('Чемпіонат світу з вейкбордингу та воднолижного спорту серед студентів',
      new Date(2020, 9, 22), new Date(2020, 9, 27), 'Дніпро', 7,  'Україна', 'Дніпропетровська обл.'),
    new Event ('Кубок України з боксу серед студентів',
      new Date(2020, 4, 20), new Date(2020, 4, 20), 'Полтава', 8,  'Україна', 'Полтавська обл.'),
  ];
  static countId = 9;
}
